-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1
-- Время создания: Янв 17 2025 г., 17:11
-- Версия сервера: 10.4.32-MariaDB
-- Версия PHP: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `fitness-club`
--

-- --------------------------------------------------------

--
-- Структура таблицы `schedule`
--

CREATE TABLE `schedule` (
  `id` int(11) NOT NULL,
  `trainer_name` varchar(255) NOT NULL,
  `training_date` date NOT NULL,
  `training_time` time NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `schedule`
--

INSERT INTO `schedule` (`id`, `trainer_name`, `training_date`, `training_time`) VALUES
(6, 'Алексей Смирнов', '2025-01-01', '09:00:00'),
(7, 'Мария Петрова', '2025-01-01', '12:00:00'),
(8, 'Максим Кружков', '2025-01-01', '15:00:00'),
(9, 'Ксения Зайцева', '2025-01-01', '18:00:00'),
(10, 'Эдуард Соловьев', '2025-01-02', '09:30:00'),
(11, 'Мария Петрова', '2025-01-02', '12:30:00'),
(12, 'Алексей Смирнов', '2025-01-02', '15:30:00'),
(13, 'Максим Кружков', '2025-01-02', '17:00:00'),
(14, 'Ксения Зайцева', '2025-01-03', '10:00:00'),
(15, 'Эдуард Соловьев', '2025-01-03', '13:00:00'),
(16, 'Мария Петрова', '2025-01-03', '16:00:00'),
(17, 'Алексей Смирнов', '2025-01-03', '19:00:00'),
(18, 'Максим Кружков', '2025-01-04', '09:15:00'),
(19, 'Ксения Зайцева', '2025-01-04', '11:30:00'),
(20, 'Эдуард Соловьев', '2025-01-04', '14:00:00'),
(21, 'Мария Петрова', '2025-01-04', '17:30:00'),
(22, 'Алексей Смирнов', '2025-01-05', '10:00:00'),
(23, 'Максим Кружков', '2025-01-05', '12:00:00'),
(24, 'Мария Петрова', '2025-01-05', '15:30:00'),
(25, 'Ксения Зайцева', '2025-01-05', '18:30:00'),
(26, 'Эдуард Соловьев', '2025-01-06', '09:00:00'),
(27, 'Ксения Зайцева', '2025-01-06', '12:00:00'),
(28, 'Алексей Смирнов', '2025-01-06', '15:00:00'),
(29, 'Максим Кружков', '2025-01-06', '18:00:00'),
(30, 'Мария Петрова', '2025-01-07', '09:30:00'),
(31, 'Эдуард Соловьев', '2025-01-07', '12:30:00'),
(32, 'Максим Кружков', '2025-01-07', '15:30:00'),
(33, 'Ксения Зайцева', '2025-01-07', '18:00:00');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `schedule`
--
ALTER TABLE `schedule`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `schedule`
--
ALTER TABLE `schedule`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=62;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
